nummber1 = int(input("Введіть перше число: "))
nummber2 = int(input("Введіть друге число: "))

if nummber1 != nummber2: 
    if nummber1 > nummber2:
        print(nummber2, nummber1)
    else:
        print(nummber1, nummber2)
else:
    print("Ці числа рівні між собою!")

End = input()






























# Задание 4
# Пользователь вводит два числа. Определить, равны
# ли эти числа, и, если нет, вывести их на экран в порядке
# возрастания.