
while True:
    guess = input("Введіть номер дня неділі: ")

    if guess == "1":
        print("1 - Понеділок!")
    elif guess == "2":
        print("2 - Вівторок!")
    elif guess == "3":
        print("3 - Середа!")
    elif guess == "4":
        print("4 - Четвер!")
    elif guess == "5":
        print("5 - Пятниця!")
    elif guess == "6":
        print("6 - Субота!")
    elif guess == "7":
        print("7 - Неділя!")
    else:
        print("Куди поліз?")



#Пользователь вводит с клавиатуры номер дня недели
#(1-7). Необходимо вывести на экран названия дня недели. Например, если 1, то на экране надпись понедельник,
#2 — вторник и т.д.
