

while True:
    guess = input("Введіть номер дня Місяця: ")

    if guess == "1":
        print("1 - Cічень!")

    elif guess == "2":
        print("2 - Лютий!")

    elif guess == "3":
        print("3 - Березень!")

    elif guess == "4":
        print("4 - Квітень!")

    elif guess == "5":
        print("5 - Травень!")

    elif guess == "6":
        print("6 - Червень!")

    elif guess == "7":
        print("7 - Липень!")

    elif guess == "8":
        print("8 - Серпень!")

    elif guess == "9":
        print("9 - Вересень!")

    elif guess == "10":
        print("10 - Жовтень!")

    elif guess == "11":
        print("11 - Листопад!")

    elif guess == "12":
        print("12 - Грудень!")

    else:
        print("Куди поліз?")



#Задание 2
#Пользователь вводит с клавиатуры номер месяца
#(1-12). Необходимо вывести на экран название месяца.
#Например, если 1, то на экране надпись январь, 2 — февраль и т.д.
