s = input("")

s = s.replace(" ", "")
qr=s[::-1]
if s==qr:
    print("palindrome")
else:
    print("NOT palindrome")
'''   
Пользователь вводит с клавиатуры строку. Проверьте
является ли введенная строка палиндромом. Палиндром — слово или текст, которое читается одинаково
слева направо и справа налево. Например, кок; А роза
упала на лапу Азора; доход; А буду я у дуба.'''

