print(len([i for i in range(100, 999) if len(set(str(i))) == 2]))


'''Задание 2
Подсчитать количество целых чисел в диапазоне от
100 до 999 у которых есть две одинаковые цифры.'''








