x = int(input("Введите первое число: "))
y = int(input("Введите второе число: "))

for i in range(x ** y+1):
    print(i, end=" ")



# Задание 1
# Напишите программу, которая запрашивает два
# целых числа x и y, после чего вычисляет и выводит
# значение x в степени y.