print(len([i for i in range(100, 9999) if len(set(str(i))) == 2]))


'''Задание 3
Подсчитать количество целых чисел в диапазоне от
100 до 9999 у которых все цифры разные.'''