a = int(input("Задай розмір клітинки: "))

for i in range(a * 1):
    if "***" * a and "___" * a:
        print("***", "___", "***", "___", "***", "___", end="")

    if "***" * a and "___" * a:
        print("***", "___")

for i in range(a):
    if "___" * a and "***" * a:
        print("___", "***", "___", "***", "___", "***", end="")

    if "___" * a and "***" * a:
        print("___", "***")

# Задание 2
# Написать программу, которая выводит на экран
# шахматную доску с заданным размером клеточки. Например, три,
# ***---***---***---***---
# ***---***---***---***---
# ***---***---***---***---
# ---***---***---***---***
# ---***---***---***---***
# ---***---***---***---***

'''Вибачаюсь але я не зрозумів що потрібно в задачі тому зробив два варіанти! Це другий: (Будь ласка перевірте)
a = int(input("Задай розмір клітинки: "))

for i in range(a):
    print("*"*a, "_"*a, end="")
    if "*" * 1:
         print("*"*a, "_"*a, end="")
     if "*" * 1:
         print("*"*a, "_"*a)

 for i in range(a):
     print("-"*a, "*"*a, end="")
     if "-" * 1:
         print("_"*a, "*"*a, end="")
     if "-" * 1:
         print("-"*a, "*"*a)'''